// Функціональні вікна (alert, prompt, confirm)

alert("Буде спливаюче вікно де не має толкової взаємодії з користувачем");
let massage = confirm("Чи все вам подобається?"); // те саме вікно й що алерт, але там буде "ок" або "скасувати" і якщо користувач вибере ок = true скасувати = false
console.log(massage);


let ms = confirm("Чи все вам подобається?"); // те саме вікно й що алерт, але там буде "ок" або "скасувати" і якщо користувач вибере ок = true скасувати = false
if (ms) {
    alert("користувач вибрав true");
}
else {
    console.log("користувач вибрав false")
}

let userInfoprompt = prompt("How are you?", "Okay") // можна буде ввести текст, якщо скасувати видасть null а при вводі збереже текст.
// Okey - буде як значання по замовчуваню, типу як placeholder, але його можна буде змінити і взаєможіяти з ним
if (userInfoprompt == null){
    alert("ви нічого не ввели!");
}
else {
    console.log(userInfoprompt);
}